---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintArcLength
source: html/590dd202-d5af-8334-bcbd-9fe981b2954c.htm
---
# RebarShapeConstraintArcLength Properties

Specifies whether the .NET object represents a valid Revit entity.